tap "davidbudnick/tap"
tap "nikitabobko/tap"
tap "oven-sh/bun"
tap "valkyrie00/bbrew"
brew "bat"
brew "btop"
brew "exiftool"
brew "eza"
brew "ffmpeg"
brew "fzf"
brew "fzf-tab"
brew "imagemagick"
brew "inetutils"
brew "lazydocker"
brew "lazygit"
brew "lazysql"
brew "mysql", restart_service: :changed
brew "neovim"
brew "nmap"
brew "ollama"
brew "openjdk"
brew "openjdk@17"
brew "p7zip"
brew "poppler"
brew "pstree"
brew "redis"
brew "resvg"
brew "ripgrep"
brew "sshpass"
brew "starship"
brew "stow"
brew "tailscale"
brew "tlrc"
brew "tmux"
brew "uv"
brew "vivid"
brew "wget"
brew "yazi"
brew "zoxide"
brew "oven-sh/bun/bun"
brew "valkyrie00/bbrew/bbrew"
cask "nikitabobko/tap/aerospace"
cask "firefox"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "libreoffice"
cask "maccy"
cask "microsoft-outlook"
cask "davidbudnick/tap/redis-tui"
cask "sublime-text"
cask "utm"
cask "vlc"
vscode "astral-sh.ty"
vscode "blodwynn.featurehighlight"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "fermelone.simple-browser-multi"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "redis.redis-for-vscode"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
uv "alembic"
uv "python-dotenv"
uv "schemathesis"
npm "cloudflared"
npm "corepack"
