abseil
aom
brotli
bun
ca-certificates
cairo
dav1d
exiftool
eza
fd
ffmpeg
fontconfig
freetype
fzf
gettext
giflib
glib
gmp
gnupg
gnutls
gpgme
gpgmepp
graphite2
harfbuzz
highway
icu4c@78
imagemagick
imath
jpeg-turbo
jpeg-xl
lame
lazygit
lazysql
libassuan
libde265
libdeflate
libevent
libgcrypt
libgit2
libgpg-error
libheif
libidn2
libksba
liblinear
libnghttp2
libpng
libssh2
libtasn1
libtiff
libtool
libunistring
libusb
libuv
libvmaf
libvpx
libx11
libxau
libxcb
libxdmcp
libxext
libxrender
little-cms2
lpeg
lua
luajit
luv
lz4
lzo
m4
mpdecimal
mysql
ncurses
neovim
nettle
nmap
npth
nspr
nss
openexr
openjdk
openjdk@17
openjpeg
openjph
openssl@3
opus
p11-kit
p7zip
pcre2
pinentry
pixman
poppler
protobuf
pstree
python@3.14
readline
redis
resvg
ripgrep
sdl2
shared-mime-info
sqlite
starship
svt-av1
tailscale
tmux
tree-sitter@0.25
unbound
unibilium
utf8proc
uv
vivid
webp
x264
x265
xorgproto
xz
zlib-ng-compat
zstd
aerospace
clipy
font-jetbrains-mono-nerd-font
ghostty
libreoffice
sublime-text
vlc
wireshark-app
