tap "nikitabobko/tap"
tap "oven-sh/bun"
brew "exiftool"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "fzf-tab"
brew "imagemagick"
brew "inetutils"
brew "lazygit"
brew "lazysql"
brew "mysql", restart_service: :changed
brew "neovim"
brew "nmap"
brew "openjdk"
brew "openjdk@17"
brew "p7zip"
brew "poppler"
brew "pstree"
brew "redis"
brew "resvg"
brew "ripgrep"
brew "starship"
brew "tailscale"
brew "tmux"
brew "uv"
brew "vivid"
brew "oven-sh/bun/bun"
cask "nikitabobko/tap/aerospace"
cask "clipy"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "libreoffice"
cask "microsoft-outlook"
cask "sublime-text"
cask "vlc"
cask "wireshark-app"
vscode "astral-sh.ty"
vscode "blodwynn.featurehighlight"
vscode "bradlc.vscode-tailwindcss"
vscode "dbaeumer.vscode-eslint"
vscode "esbenp.prettier-vscode"
vscode "fermelone.simple-browser-multi"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-vscode-remote.remote-containers"
vscode "redis.redis-for-vscode"
vscode "supermaven.supermaven"
vscode "svelte.svelte-vscode"
vscode "tomoki1207.pdf"
uv "alembic"
uv "python-dotenv"
uv "schemathesis"
