exiftool
eza
fd
ffmpeg
fzf
imagemagick
lazygit
lazysql
mysql
neovim
nmap
openjdk
openjdk@17
oven-sh/bun/bun
p7zip
poppler
pstree
redis
resvg
ripgrep
starship
tailscale
tmux
uv
vivid
